public class Lesson9 {
    /**
     * Задание 9
     * Необходимо нарисовать ёлочку символом «звёздочка».
     * Каждый новый ярус должен быть шире предыдущего. С
     * клавиатуры вводится количество ярусов, и высота первого
     * (верхнего) яруса ёлочки (количество строк в ярусе). Ёлочка
     * должна быть симметричная.
     * Задание 6
     * Нарисовать на экране лесенку. Количество ступенек указывает пользователь с клавиатуры.
     * Пример лесенки на 3 ступеньки:
     * 4
     * Пример работы программы
     */

    public static void main(String[] args) {

    }

    public static void fir() {

    }
}
